IdeaRS.OpenModel.OpenModel
Open model

IdeaRS.OpenModel.OpenModel.#ctor
Constructor

IdeaRS.OpenModel.OpenModel.GetMaxId(System.String)
Get max Id value for specified type
typeName: Name of type
Returns: Max Id value or zero if don't any exists

IdeaRS.OpenModel.OpenModel.GetMaxId(IdeaRS.OpenModel.OpenElementId)
Get max Id value for specified type
obj: Object
Returns: Max Id value or zero if don't any exists

IdeaRS.OpenModel.OpenModel.GetMaxId(System.Type)
Get max Id value for specified type
t: Type
Returns: Max Id value or zero if don't any exists

IdeaRS.OpenModel.OpenModel.AddObject(IdeaRS.OpenModel.OpenElementId)
Add new object into collections
obj: Added object
Returns: Return value 0 - OK, -1 - duplicit Id, -10 - the type of object there is not in the data colections
Remarks:
If the obj.Id is set to zero or lesser, this method finds the first available free Id and sets it into the obj.Id.

IdeaRS.OpenModel.OpenModel.AddObject(IdeaRS.OpenModel.OpenAttribute)
Add new atribute object into collections
obj: Added object
Returns: Return value 0 - OK, -1 - false
Remarks:

IdeaRS.OpenModel.OpenModel.SaveToXmlFile(System.String)
Saves content into file as a XML format
xmlFileName: XML file name
Returns: True if succeeded

IdeaRS.OpenModel.OpenModel.LoadFromXmlFile(System.String)
Creates the instance of Open Model from the XML file
xmlFileName: XML file name
Returns: Open Model or null

IdeaRS.OpenModel.OpenModel.LoadFromStream(System.IO.Stream)
Creates the instance of Open Model from the stream
xmlFileStream: The input stream
Returns: The new instance of Open Model

IdeaRS.OpenModel.OpenModel.GetObject(IdeaRS.OpenModel.ReferenceElement)
Gets the Open element object from the Reference element
element: Reference element
Returns: The instance of  OpenElementId object

IdeaRS.OpenModel.OpenModel.Version
Data format version

IdeaRS.OpenModel.OpenModel.OriginSettings
Information about origin project

IdeaRS.OpenModel.OpenModel.Point3D
List of Point3D

IdeaRS.OpenModel.OpenModel.LineSegment3D
List of LineSegment3D

IdeaRS.OpenModel.OpenModel.ArcSegment3D
List of ArcSegment3D

IdeaRS.OpenModel.OpenModel.PolyLine3D
List of PolyLine3D

IdeaRS.OpenModel.OpenModel.Region3D
List of Region3D

IdeaRS.OpenModel.OpenModel.MatConcrete
List of MatConcrete

IdeaRS.OpenModel.OpenModel.MatReinforcement
List of MatReinforcement

IdeaRS.OpenModel.OpenModel.MatSteel
List of MatSteel

IdeaRS.OpenModel.OpenModel.MatPrestressSteel
List of MatPrestressSteel

IdeaRS.OpenModel.OpenModel.CrossSection
List of CrossSection

IdeaRS.OpenModel.OpenModel.ReinforcedCrossSection
List of Reinforced CrossSection

IdeaRS.OpenModel.OpenModel.HingeElement1D
List of hinge elements 1D

IdeaRS.OpenModel.OpenModel.Element1D
List of Elements 1D

IdeaRS.OpenModel.OpenModel.Member1D
List of Member 1D

IdeaRS.OpenModel.OpenModel.Element2D
List of Elements 2D

IdeaRS.OpenModel.OpenModel.Member2D
List of Member 2D

IdeaRS.OpenModel.OpenModel.RigidLink
List of Rigid link

IdeaRS.OpenModel.OpenModel.PointOnLine3D
List of Point on line 3D

IdeaRS.OpenModel.OpenModel.PointSupportNode
List of Point support in node

IdeaRS.OpenModel.OpenModel.LineSupportSegment
List of Line support on segment

IdeaRS.OpenModel.OpenModel.LoadsInPoint
List of point load impulses in this load case

IdeaRS.OpenModel.OpenModel.LoadsOnLine
List of line load impulses in this load case

IdeaRS.OpenModel.OpenModel.StrainLoadsOnLine
List of generalized strain load impulses along the line in this load case.

IdeaRS.OpenModel.OpenModel.PointLoadsOnLine
List of point load impulses in this load case

IdeaRS.OpenModel.OpenModel.LoadsOnSurface
List surafce load in this load case

IdeaRS.OpenModel.OpenModel.Settlements
Settlements in this load case

IdeaRS.OpenModel.OpenModel.TemperatureLoadsOnLine
List of temperature load in this load case

IdeaRS.OpenModel.OpenModel.LoadGroup
List of Load groups

IdeaRS.OpenModel.OpenModel.LoadCase
List of Load cases

IdeaRS.OpenModel.OpenModel.CombiInput
List of Combinations

IdeaRS.OpenModel.OpenModel.Attribute
List of attributes

IdeaRS.OpenModel.OpenModel.ConnectionPoint
List of Connection Points

IdeaRS.OpenModel.OpenModel.InitialImperfectionOfPoint
List of InitialmperfectionOfPoint

IdeaRS.OpenModel.OpenModel.Tendon
Tendon

IdeaRS.OpenModel.OpenModel.ConnectionSetup
Information about Connection Setup

IdeaRS.OpenModel.OpenModel.ProjectData
Gets or sets the projet data